<?xml version="1.0" ?>
<net name="face_landmark_with_ffd_regression" version="10">
	<layers>
		<layer id="0" name="const_fold_opt__703" type="Const" version="opset1">
			<data offset="0" size="808704" shape="1404,32,3,3" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="const_fold_opt__703">
					<dim>1404</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="const_fold_opt__623" type="Const" version="opset1">
			<data offset="808704" size="8192" shape="32,128,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="const_fold_opt__623">
					<dim>32</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="input_1" type="Parameter" version="opset1">
			<data shape="1,3,192,192" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="input_1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>192</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="const_fold_opt__559" type="Const" version="opset1">
			<data offset="816896" size="864" shape="16,3,3,3" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="const_fold_opt__559">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="conv2d_1/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="2,2" dilations="1,1" pads_begin="0,0" pads_end="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>192</dim>
					<dim>192</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="conv2d_1/Dims2286" type="Const" version="opset1">
			<data offset="817760" size="32" shape="1,16,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="conv2d_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="conv2d_1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="const_fold_opt__613" type="Const" version="opset1">
			<data offset="817792" size="64" shape="1,16,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="const_fold_opt__613">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="p_re_lu_1" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="p_re_lu_1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="const_fold_opt__645" type="Const" version="opset1">
			<data offset="817856" size="512" shape="16,16,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="const_fold_opt__645">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="const_fold_opt__700" type="Const" version="opset1">
			<data offset="818368" size="288" shape="16,1,1,3,3" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="const_fold_opt__700">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="depthwise_conv2d_1/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="1,1" pads_end="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="depthwise_conv2d_1/Dims2310" type="Const" version="opset1">
			<data offset="818656" size="32" shape="1,16,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="depthwise_conv2d_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="depthwise_conv2d_1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="conv2d_2/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="conv2d_2/Dims2328" type="Const" version="opset1">
			<data offset="818688" size="32" shape="1,16,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="conv2d_2" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="conv2d_2">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="add_1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="const_fold_opt__661" type="Const" version="opset1">
			<data offset="818720" size="64" shape="1,16,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="const_fold_opt__661">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="p_re_lu_2" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="p_re_lu_2">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="const_fold_opt__627" type="Const" version="opset1">
			<data offset="818784" size="512" shape="16,16,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="const_fold_opt__627">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="const_fold_opt__672" type="Const" version="opset1">
			<data offset="819296" size="288" shape="16,1,1,3,3" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="const_fold_opt__672">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="depthwise_conv2d_2/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="1,1" pads_end="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="depthwise_conv2d_2/Dims2376" type="Const" version="opset1">
			<data offset="818656" size="32" shape="1,16,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="depthwise_conv2d_2" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="depthwise_conv2d_2">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="conv2d_3/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="conv2d_3/Dims2334" type="Const" version="opset1">
			<data offset="819584" size="32" shape="1,16,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="conv2d_3" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="conv2d_3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="add_2" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="add_2">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="const_fold_opt__571" type="Const" version="opset1">
			<data offset="819616" size="64" shape="1,16,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="const_fold_opt__571">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="p_re_lu_3" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="p_re_lu_3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="max_pooling2d_1" type="MaxPool" version="opset1">
			<data strides="2,2" kernel="2,2" pads_begin="0,0" pads_end="0,0" rounding_type="floor" auto_pad="explicit"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="max_pooling2d_1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="channel_padding_1/pad_value_convert_input_port_0/value" type="Const" version="opset1">
			<data offset="819680" size="2" shape="" element_type="f16"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="33" name="channel_padding_1/pad_value_convert" type="ConvertLike" version="opset1">
			<input>
				<port id="0"/>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16"/>
			</output>
		</layer>
		<layer id="34" name="218" type="Const" version="opset1">
			<data offset="819682" size="32" shape="4" element_type="i64"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="219" type="Const" version="opset1">
			<data offset="819714" size="32" shape="4" element_type="i64"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="channel_padding_1" type="Pad" version="opset1">
			<data pad_mode="constant"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
				<port id="2">
					<dim>4</dim>
				</port>
				<port id="3"/>
			</input>
			<output>
				<port id="4" precision="FP16" names="channel_padding_1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="const_fold_opt__681" type="Const" version="opset1">
			<data offset="819746" size="1024" shape="32,16,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="const_fold_opt__681">
					<dim>32</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="const_fold_opt__621" type="Const" version="opset1">
			<data offset="820770" size="288" shape="16,1,1,3,3" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="const_fold_opt__621">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="depthwise_conv2d_3/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" strides="2,2" dilations="1,1" pads_begin="0,0" pads_end="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="depthwise_conv2d_3/Dims2484" type="Const" version="opset1">
			<data offset="821058" size="32" shape="1,16,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="depthwise_conv2d_3" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="depthwise_conv2d_3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="conv2d_4/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="conv2d_4/Dims2424" type="Const" version="opset1">
			<data offset="821090" size="64" shape="1,32,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="conv2d_4" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="conv2d_4">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="add_3" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="add_3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="const_fold_opt__648" type="Const" version="opset1">
			<data offset="821154" size="128" shape="1,32,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="const_fold_opt__648">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="p_re_lu_4" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="p_re_lu_4">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="const_fold_opt__446" type="Const" version="opset1">
			<data offset="821282" size="2048" shape="32,32,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="const_fold_opt__446">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="const_fold_opt__678" type="Const" version="opset1">
			<data offset="823330" size="576" shape="32,1,1,3,3" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="const_fold_opt__678">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="depthwise_conv2d_4/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="1,1" pads_end="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="depthwise_conv2d_4/Dims2532" type="Const" version="opset1">
			<data offset="823906" size="64" shape="1,32,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="depthwise_conv2d_4" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="depthwise_conv2d_4">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="conv2d_5/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="conv2d_5/Dims2538" type="Const" version="opset1">
			<data offset="823970" size="64" shape="1,32,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="conv2d_5" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="conv2d_5">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="add_4" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="add_4">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="const_fold_opt__581" type="Const" version="opset1">
			<data offset="824034" size="128" shape="1,32,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="const_fold_opt__581">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="p_re_lu_5" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="p_re_lu_5">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="const_fold_opt__517" type="Const" version="opset1">
			<data offset="824162" size="2048" shape="32,32,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="const_fold_opt__517">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="const_fold_opt__639" type="Const" version="opset1">
			<data offset="826210" size="576" shape="32,1,1,3,3" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="const_fold_opt__639">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="depthwise_conv2d_5/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="1,1" pads_end="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="depthwise_conv2d_5/Dims2322" type="Const" version="opset1">
			<data offset="823906" size="64" shape="1,32,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="depthwise_conv2d_5" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="depthwise_conv2d_5">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="conv2d_6/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="conv2d_6/Dims2496" type="Const" version="opset1">
			<data offset="826786" size="64" shape="1,32,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="conv2d_6" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="conv2d_6">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="add_5" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="add_5">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="const_fold_opt__662" type="Const" version="opset1">
			<data offset="826850" size="128" shape="1,32,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="const_fold_opt__662">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="p_re_lu_6" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="p_re_lu_6">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="max_pooling2d_2" type="MaxPool" version="opset1">
			<data strides="2,2" kernel="2,2" pads_begin="0,0" pads_end="0,0" rounding_type="floor" auto_pad="explicit"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="max_pooling2d_2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="channel_padding_2/pad_value_convert_input_port_0/value" type="Const" version="opset1">
			<data offset="819680" size="2" shape="" element_type="f16"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="72" name="channel_padding_2/pad_value_convert" type="ConvertLike" version="opset1">
			<input>
				<port id="0"/>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16"/>
			</output>
		</layer>
		<layer id="73" name="223" type="Const" version="opset1">
			<data offset="826978" size="32" shape="4" element_type="i64"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="224" type="Const" version="opset1">
			<data offset="827010" size="32" shape="4" element_type="i64"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="channel_padding_2" type="Pad" version="opset1">
			<data pad_mode="constant"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
				<port id="2">
					<dim>4</dim>
				</port>
				<port id="3"/>
			</input>
			<output>
				<port id="4" precision="FP16" names="channel_padding_2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="const_fold_opt__513" type="Const" version="opset1">
			<data offset="827042" size="4096" shape="64,32,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="const_fold_opt__513">
					<dim>64</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="const_fold_opt__683" type="Const" version="opset1">
			<data offset="831138" size="576" shape="32,1,1,3,3" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="const_fold_opt__683">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="depthwise_conv2d_6/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" strides="2,2" dilations="1,1" pads_begin="0,0" pads_end="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="depthwise_conv2d_6/Dims2544" type="Const" version="opset1">
			<data offset="823906" size="64" shape="1,32,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="depthwise_conv2d_6" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="depthwise_conv2d_6">
					<dim>1</dim>
					<dim>32</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="conv2d_7/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="conv2d_7/Dims2412" type="Const" version="opset1">
			<data offset="831714" size="128" shape="1,64,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="conv2d_7" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="conv2d_7">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="add_6" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="add_6">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="const_fold_opt__594" type="Const" version="opset1">
			<data offset="831842" size="256" shape="1,64,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="const_fold_opt__594">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="p_re_lu_7" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="p_re_lu_7">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="const_fold_opt__509" type="Const" version="opset1">
			<data offset="832098" size="8192" shape="64,64,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="const_fold_opt__509">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="const_fold_opt__667" type="Const" version="opset1">
			<data offset="840290" size="1152" shape="64,1,1,3,3" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="const_fold_opt__667">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="depthwise_conv2d_7/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="1,1" pads_end="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="depthwise_conv2d_7/Dims2358" type="Const" version="opset1">
			<data offset="841442" size="128" shape="1,64,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="depthwise_conv2d_7" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="depthwise_conv2d_7">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="conv2d_8/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="conv2d_8/Dims2316" type="Const" version="opset1">
			<data offset="841570" size="128" shape="1,64,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="conv2d_8" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="conv2d_8">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="add_7" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="add_7">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="const_fold_opt__677" type="Const" version="opset1">
			<data offset="841698" size="256" shape="1,64,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="const_fold_opt__677">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="p_re_lu_8" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="p_re_lu_8">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="const_fold_opt__698" type="Const" version="opset1">
			<data offset="841954" size="8192" shape="64,64,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="const_fold_opt__698">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="const_fold_opt__704" type="Const" version="opset1">
			<data offset="850146" size="1152" shape="64,1,1,3,3" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="const_fold_opt__704">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="depthwise_conv2d_8/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="1,1" pads_end="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="depthwise_conv2d_8/Dims2394" type="Const" version="opset1">
			<data offset="841442" size="128" shape="1,64,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="depthwise_conv2d_8" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="depthwise_conv2d_8">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="conv2d_9/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="conv2d_9/Dims2298" type="Const" version="opset1">
			<data offset="851298" size="128" shape="1,64,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="conv2d_9" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="conv2d_9">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="add_8" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="add_8">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="const_fold_opt__492" type="Const" version="opset1">
			<data offset="851426" size="256" shape="1,64,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="const_fold_opt__492">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="p_re_lu_9" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="p_re_lu_9">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="max_pooling2d_3" type="MaxPool" version="opset1">
			<data strides="2,2" kernel="2,2" pads_begin="0,0" pads_end="0,0" rounding_type="floor" auto_pad="explicit"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="max_pooling2d_3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="channel_padding_3/pad_value_convert_input_port_0/value" type="Const" version="opset1">
			<data offset="819680" size="2" shape="" element_type="f16"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="111" name="channel_padding_3/pad_value_convert" type="ConvertLike" version="opset1">
			<input>
				<port id="0"/>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16"/>
			</output>
		</layer>
		<layer id="112" name="228" type="Const" version="opset1">
			<data offset="826978" size="32" shape="4" element_type="i64"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="229" type="Const" version="opset1">
			<data offset="851682" size="32" shape="4" element_type="i64"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="channel_padding_3" type="Pad" version="opset1">
			<data pad_mode="constant"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
				<port id="2">
					<dim>4</dim>
				</port>
				<port id="3"/>
			</input>
			<output>
				<port id="4" precision="FP16" names="channel_padding_3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="const_fold_opt__615" type="Const" version="opset1">
			<data offset="851714" size="16384" shape="128,64,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="const_fold_opt__615">
					<dim>128</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="const_fold_opt__682" type="Const" version="opset1">
			<data offset="868098" size="1152" shape="64,1,1,3,3" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="const_fold_opt__682">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="depthwise_conv2d_9/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" strides="2,2" dilations="1,1" pads_begin="0,0" pads_end="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="depthwise_conv2d_9/Dims2508" type="Const" version="opset1">
			<data offset="841442" size="128" shape="1,64,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="depthwise_conv2d_9" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
